IRP/src/Tasks/ExecutorTasks/ExecutorTasks.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Task>
 <name>ExecutorTasks</name>
 <addressing>InformationRegister.TaskExecutors</addressing>
 <attributes>
  <name>TaskID</name>
  <type>
   <types>UUID</types>
  </type>
 </attributes>
 <attributes>
  <name>IterationNumber</name>
  <type>
   <types>Number</types>
   <numberQualifiers>
    <precision>5</precision>
   </numberQualifiers>
  </type>
 </attributes>
 <attributes>
  <name>TaskType</name>
  <type>
   <types>EnumRef.TaskTypes</types>
  </type>
 </attributes>
 <attributes>
  <name>Detailing</name>
  <type>
   <types>String</types>
  </type>
 </attributes>
 <attributes>
  <name>ExecutionObject</name>
  <type>
   <types>DocumentRef</types>
   <types>CatalogRef</types>
  </type>
 </attributes>
 <attributes>
  <name>ExecutionDate</name>
  <type>
   <types>Date</types>
  </type>
 </attributes>
 <attributes>
  <name>AcceptetionForExecutionDate</name>
  <type>
   <types>Date</types>
  </type>
 </attributes>
 <attributes>
  <name>Canceled</name>
  <type>
   <types>Boolean</types>
  </type>
 </attributes>
 <attributes>
  <name>AutoExecute</name>
  <type>
   <types>Boolean</types>
  </type>
 </attributes>
 <addressingAttributes>
  <name>CurrentExecutor</name>
  <type>
   <types>CatalogRef.Users</types>
  </type>
 </addressingAttributes>
 <addressingAttributes>
  <name>UserGroup</name>
  <type>
   <types>CatalogRef.UserGroups</types>
  </type>
 </addressingAttributes>
 <addressingAttributes>
  <name>Position</name>
  <type>
   <types>CatalogRef.EmployeePositions</types>
  </type>
 </addressingAttributes>
 <addressingAttributes>
  <name>Branch</name>
  <type>
   <types>CatalogRef.BusinessUnits</types>
  </type>
 </addressingAttributes>
 <addressingAttributes>
  <name>ProfitLossCenter</name>
  <type>
   <types>CatalogRef.BusinessUnits</types>
  </type>
 </addressingAttributes>
</mdclass:Task>

IRP/src/Tasks/ExecutorTasks/ObjectModule.bsl
// @strict-types

Procedure BeforeExecute(Cancel)
	
	If AcceptetionForExecutionDate = Date(1,1,1) Then
		AcceptetionForExecutionDate = ExecutionDate;
	EndIf;

EndProcedure

Procedure OnWrite(Cancel)
	
	If AutoExecute And Not Executed Then
		AutoExecute = False;
		ExecuteTask();
	EndIf;

EndProcedure

Procedure BeforeWrite(Cancel)
	
	If Executed Then
		If CurrentExecutor.IsEmpty() Then
			CurrentExecutor = SessionParameters.CurrentUser;
		EndIf;
		If ExecutionDate = Date(1,1,1) Then
			ExecutionDate = CommonFunctionsServer.GetCurrentSessionDate();
		EndIf;
	EndIf;
	
EndProcedure
